Import pandas

In [1]:
import pandas as pd
print(pd.__version__)

2.3.1

Read data from `csv/excel/json` file into a dataframe

In [4]:
# read excel file
df = pd.read_excel("Routine bca 3rd sem.xlsx")
df.head()

,"AMITY INSTITUTE OF INFORMATION TECHNOLOGY, AMITY UNIVERSITY PATNA",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,CLASS SCHEDULE for BCA-I (A) (2025-2029),NaN,NaN,NaN,NaN,NaN,NaN
1,"Room No. - , Class Teacher:",NaN,NaN,NaN,NaN,NaN,NaN
2,Day/Timing,08:30-09:15,09:20-10:05,10:10-10:55,11:00-11:45,11:50-12:35,01:00-01:45
3,Monday,NaN,NaN,NaN,NaN,NaN,NaN
4,Tuesday,Computer Architecture- Dr. Vinay Shankar,Introduction to French-& Francophone world-VACANT,21st Century Communication Skills -Vacant,Problem Solving Techniques Using C Program-Mr....,NaN,NaN

In [5]:
# read csv file
df = pd.read_csv("sales_data_sample.csv",encoding="latin1")
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [6]:
# read json file
df = pd.read_json("students.json")
df.head()

       Name  age
0     Harsh   19
1  Prashant   22
2      Ravi   45

Write and save data in file

In [7]:
data = {
    'Name':['Harsh','Prashant','Ravi'],
    'age':[19,22,45]

}
df = pd.DataFrame(data)
# save to csv
df.to_csv("students.csv",encoding="latin1")

# save to excel
df.to_excel('students.xlsx',index=False)

# save to json
df.to_json("students.json",index=False)

Display the first few rows and last few rows

In [9]:
# Display First few rows. use head()

df = pd.read_excel('Routine bca 3rd sem.xlsx')

print("Dispaly 10 rows of the first")
df.head(10)

Dispaly 10 rows of the first

,"AMITY INSTITUTE OF INFORMATION TECHNOLOGY, AMITY UNIVERSITY PATNA",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,CLASS SCHEDULE for BCA-I (A) (2025-2029),NaN,NaN,NaN,NaN,NaN,NaN
1,"Room No. - , Class Teacher:",NaN,NaN,NaN,NaN,NaN,NaN
2,Day/Timing,08:30-09:15,09:20-10:05,10:10-10:55,11:00-11:45,11:50-12:35,01:00-01:45
3,Monday,NaN,NaN,NaN,NaN,NaN,NaN
4,Tuesday,Computer Architecture- Dr. Vinay Shankar,Introduction to French-& Francophone world-VACANT,21st Century Communication Skills -Vacant,Problem Solving Techniques Using C Program-Mr....,NaN,NaN
5,Wednesday,Indian Culture and Civilization-Mr. Prasanna K...,Computer Architecture- Dr. Vinay Shankar,Mathematics Foundations to Computer Science-I-...,21st Century Communication Skills -Vacant,NaN,NaN
6,Thursday,Indian Culture and Civilization-Mr. Prasanna K...,Computer Architecture- Dr. Vinay Shankar,Mathematics Foundations to Computer Science-I-...,21st Century Communication Skills -Vacant,NaN,NaN
7,Friday,Mathematics Foundations to Computer Science-I-...,Introduction to French-& Francophone world-VACANT,Computer Architecture- Dr. Vinay Shankar-LAB-3,Problem Solving Techniques Using C Program-Mr....,NaN,NaN
8,Saturday,Computer Architecture- Dr. Vinay Shankar-LAB-3,Problem Solving Techniques Using C Program-Mr....,Problem Solving Techniques Using C Program-Mr....,Problem Solving Techniques Using C Program-Mr....,NaN,NaN

In [10]:
# Display last few rows. tail()

df = pd.read_csv("students.csv",encoding="latin1")

print("Display last 10 rows")
df.tail()

Display last 10 rows

   Unnamed: 0      Name  age
0           0     Harsh   19
1           1  Prashant   22
2           2      Ravi   45

**pd.info( ):** The .info() method in pandas provides a concise summary of a DataFrame. Itâ€™s mainly used to check the structure and data types of your dataset.

In [ ]:
students = {
    "Name": ['Mantosh kumar','sumant kumar','Prashant kuamr','Ravi kumar','Sparsh Avi','Rishi kumar','Anmol kumar','Aditya kumar'],
    "Age": [18,20,21,22,19,23,18,19],
    "Roll No":[151,152,153,154,155,156,157,158]

}
df = pd.DataFrame(students)
print("Display info. about table")
df.info()

Display info. about table
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     8 non-null      object
 1   Age      8 non-null      int64
 2   Roll No  8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 324.0+ bytes

**Discribe method :** The .describe() method in pandas is used to generate Statistics of numeric (or all) columns in a DataFrame.

In [ ]:
Employee = {
    "Name":['Dhananjay kumar pathak','Aarav pal','Harsh kumar','Prince Kumar','Om kuamr','Vaibhav kumar','Anmol Ray','Rohan Kumar','Tannu Kumari','Prashant Kumar','Rishi Ranjan'],
    "Age":[22,22,19,18,20,19,21,23,18,22,19],
    "ID":[4001,4002,4003,4004,4005,4006,4007,4008,4009,4010,4011],
    "Company":"Infosys",
    "Salery":[25000,35000,85000,75000,92000,56000,34000,67000,78000,45000,45500]

}

df = pd.DataFrame(Employee)
df.to_excel("Employee_info.xlsx",index=False)
print("Statistics")
print(df.describe())

**.shape :** Returns a tuple representing the dimensions of the DataFrame.

**Format â†’** (rows, columns)

***Helps to quickly check dataset size.***

In [5]:
Employee = {
    "Name":['Dhananjay kumar pathak','Aarav pal','Harsh kumar','Prince Kumar','Om kuamr','Vaibhav kumar','Anmol Ray','Rohan Kumar','Tannu Kumari','Prashant Kumar','Rishi Ranjan'],
    "Age":[22,22,19,18,20,19,21,23,18,22,19],
    "ID":[4001,4002,4003,4004,4005,4006,4007,4008,4009,4010,4011],
    "Company":"Infosys",
    "Salery":[25000,35000,85000,75000,92000,56000,34000,67000,78000,45000,45500]

}

df = pd.DataFrame(Employee)
print("Enployee Info")
print(df,"\n")

# Shape of Data
print(f"Shape: {df.shape}")

Enployee Info
                      Name  Age    ID  Company  Salery
0   Dhananjay kumar pathak   22  4001  Infosys   25000
1                Aarav pal   22  4002  Infosys   35000
2              Harsh kumar   19  4003  Infosys   85000
3             Prince Kumar   18  4004  Infosys   75000
4                 Om kuamr   20  4005  Infosys   92000
5            Vaibhav kumar   19  4006  Infosys   56000
6                Anmol Ray   21  4007  Infosys   34000
7              Rohan Kumar   23  4008  Infosys   67000
8             Tannu Kumari   18  4009  Infosys   78000
9           Prashant Kumar   22  4010  Infosys   45000
10            Rishi Ranjan   19  4011  Infosys   45500

Shape: (11, 5)

**.Columns :** Returns an Index object containing column labels.
               Useful to list, rename, or check columns in a DataFrame.

In [6]:
# Columns Name
print(df.columns)

Index(['Name', 'Age', 'ID', 'Company', 'Salery'], dtype='object')

**Selecting Single Columns :** Use df['column_name'] Returns a Series (1D data).

**Selecting Multiple columns :** Use a list of column names inside double brackets: df[['col1', 'col2']]

Returns a DataFrame (2D data).

In [7]:
students = {
    "Name": ['Sahil kumar','sumant kumar','Prashant kuamr','Ravi kumar','Sparsh Avi','Rishi kumar','Anmol kumar','Aditya kumar'],
    "Age": [18,20,21,22,19,23,18,19],
    "Roll_No":[151,152,153,154,155,156,157,158]

}
# Display Data
df = pd.DataFrame(students)
print(df)

# Select single columns
print("\n\nSingle columns")
name = df["Name"]
print(name)

             Name  Age  Roll_No
0     Sahil kumar   18      151
1    sumant kumar   20      152
2  Prashant kuamr   21      153
3      Ravi kumar   22      154
4      Sparsh Avi   19      155
5     Rishi kumar   23      156
6     Anmol kumar   18      157
7    Aditya kumar   19      158


Single columns
0       Sahil kumar
1      sumant kumar
2    Prashant kuamr
3        Ravi kumar
4        Sparsh Avi
5       Rishi kumar
6       Anmol kumar
7      Aditya kumar
Name: Name, dtype: object

In [8]:
# Select multiple columns
print("Select multiple columns")
subset = df[["Name", "Roll_No"]]
print(subset)

Select multiple columns
             Name  Roll_No
0     Sahil kumar      151
1    sumant kumar      152
2  Prashant kuamr      153
3      Ravi kumar      154
4      Sparsh Avi      155
5     Rishi kumar      156
6     Anmol kumar      157
7    Aditya kumar      158

**Filtering :** Use a comparison inside square brackets:

In [ ]:
Employee = {
    "Name":['Dhananjay kumar pathak','Aarav pal','Harsh kumar','Prince Kumar','Om kuamr','Vaibhav kumar','Anmol Ray','Rohan Kumar','Tannu Kumari','Prashant Kumar','Rishi Ranjan'],
    "Age":[22,22,19,18,20,19,21,23,18,22,19],
    "ID":[4001,4002,4003,4004,4005,4006,4007,4008,4009,4010,4011],
    "Company":"Infosys",
    "Salery":[25000,35000,85000,75000,92000,56000,34000,67000,78000,45000,45500]

}

# Display data
df = pd.DataFrame(Employee)
print(df)

# Filter Age which are greater than 20
print("\n\nFilter Age Which are greater than 20")
filter_age = df[df['Age']>20]
print(filter_age)

With multiple conditions. 

- Use & for AND

- Use | for OR

- Each condition must be in parentheses.

In [ ]:
# Filtering with multiple conditions
print("FIltering Age and salery")

filterd = df[(df['Age']>20) & (df['Salery']>50000)]
print(filterd)

# OR conditions
print("\n\nUsing OR Conditions")

filterd = df[(df['Age']>20) | (df['Salery']>50000)]
print(filterd)

**ðŸ“Œ Notebook Summary**

*1. Importing Pandas*
- Importing `pandas` and checking version.

*2. Reading Data*
- Read data into DataFrame from:
  - Excel (`pd.read_excel`)
  - CSV (`pd.read_csv`)
  - JSON (`pd.read_json`)

*3. Writing Data*
- Create a dictionary â†’ convert to DataFrame.
- Save DataFrame into:
  - CSV (`to_csv`)
  - Excel (`to_excel`)
  - JSON (`to_json`)

*4. Viewing Data*
- Display first rows using `df.head(n)`
- Display last rows using `df.tail(n)`

*5. Exploring Data*
- `df.info()` â†’ shows structure, data types, non-null counts.
- `df.describe()` â†’ generates statistics (count, mean, min, max, etc.).


*6. Shape*
- `.shape` â†’ returns dataset dimensions `(rows, columns)`.

*7. Columns*
- `.columns` â†’ lists all column names.

*8. Selecting Data*
- Single column: `df['col']`
- Multiple columns: `df[['col1', 'col2']]`


*9. Filtering*
- Example: `df[df['Age'] > 20]`



---
This notebook is a **pandas tutorial** showing how to **read, write, explore, and filter datasets** across different formats.

**ðŸ’» Pandas Coding Questions**
1. Import pandas and check its version.

2. Read data from an Excel file named `Routine.xlsx` into a DataFrame.

3. Read data from a CSV file named `sales.csv` into a DataFrame.

4. Read data from a JSON file named `students.json`.

5. Create a DataFrame with student details `(Name, Age, Roll_No)`.

6. Save the DataFrame into `CSV`, `Excel`, and `JSON` formats.

7. Display the first 10 rows of a DataFrame using `head()`.

8. Display the last 5 rows of a DataFrame using `tail()`.

9. Use `.info()` on a DataFrame and explain the output.

10. Use `.describe()` on an Employee DataFrame containing Name, Age, ID, and Salary.

11. Print the shape of a DataFrame using `.shape`.

12. List all column names of a DataFrame using `.columns`.

13. Select only the Name column from a DataFrame.

14. Select both `Name and Age` columns from a DataFrame.

15. Filter and display all students with `Age > 20`.

16. Create a new DataFrame and export it to an Excel file named `Employee_info.xlsx`.